#include <stdio.h>
#include <stdlib.h>


int main() {


    
    system("pause");
    return 0;
   
}

/*

11. 写一个函数，用"起泡法"对输入的10个字符按由小到大顺序排列。

12. 用牛顿迭代法求根。方程为ax?+bx?+cx+d=0，系数a,b,c,d的值
依次为1,2,3,4，由主函数输入。求x在1附近的一个实根。求出根后由主函数输出。

13. 用递归方法求n阶勒让德多项式的值，递归公式为

P?(x) = 
\begin{cases} 
1 & (n=0) \\
x & (n=1) \\
((2n-1)×x×P_{n-1}(x)-(n-1)×P_{n-2}(x))/n & (n≥1)
\end{cases}

14. 输入10个学生5门课的成绩，分别用函数实现下列功能：
① 计算每个学生的平均分；
② 计算每门课的平均分；
③ 找出所有50个分数中最高的分数所对应的学生和课程；
④ 计算平均分方差：
σ = \frac{1}{n}\sum x_i^2 - \left(\frac{\sum x_i}{n}\right)^2
其中，x_i为某一学生的平均分。

15. 写几个函数：
① 输入10个职工的姓名和职工号；
② 按职工号由小到大顺序排序，姓名顺序也随之调整；
③ 要求输入一个职工号，用折半查找法找出该职工的姓名，从主函数输入要查找的职工号，输出该职工姓名。

16. 写一个函数，输入一个十六进制数，输出相应的十进制数。

17. 用递归法将一个整数n转换成字符串。例如，输入483，应输出字符串"483"。n的位数不确定，可以是任意位数的整数。

18. 给出年、月、日，计算该日是该年的第几天。
*/